{
  "metadata": {
    "totalCases": 55,
    "lastUpdated": "2025-01-20",
    "courts": ["ECtHR", "IACtHR", "ICJ", "HRCtee"]
  },
  "cases": [
    {
      "id": "ireland-v-uk",
      "name": "Ireland v. United Kingdom",
      "year": 1978,
      "court": "ECtHR",
      "articles": ["3"],
      "category": "torture",
      "importance": "landmark",
      "facts": "Ireland brought a case against the UK concerning interrogation techniques ('five techniques') used on suspected IRA members in Northern Ireland: wall-standing, hooding, subjection to noise, sleep deprivation, and deprivation of food and drink.",
      "issue": "Whether the five techniques constituted torture or inhuman/degrading treatment under Article 3 ECHR.",
      "holding": "The Court found the techniques constituted inhuman and degrading treatment but NOT torture. Torture requires a particularly serious and cruel level of suffering.",
      "significance": "Established the threshold distinction between torture and inhuman/degrading treatment. Set the standard that torture requires deliberate infliction of severe suffering for a purpose.",
      "keywords": ["torture", "inhuman treatment", "degrading treatment", "five techniques", "threshold"]
    },
    {
      "id": "soering-v-uk",
      "name": "Soering v. United Kingdom",
      "year": 1989,
      "court": "ECtHR",
      "articles": ["3"],
      "category": "extradition",
      "importance": "landmark",
      "facts": "Jens Soering, a German national, faced extradition to Virginia, USA, where he could face the death penalty for murder. He argued extradition would expose him to the 'death row phenomenon.'",
      "issue": "Whether extradition to face potential death penalty and death row conditions would violate Article 3.",
      "holding": "The Court found that extradition would violate Article 3 due to the risk of inhuman treatment from the death row phenomenon (prolonged wait, conditions, psychological suffering).",
      "significance": "Extended Article 3 protection extraterritorially. States cannot extradite/deport where there's real risk of torture or inhuman treatment in receiving state. Foundation of non-refoulement under ECHR.",
      "keywords": ["extradition", "death penalty", "death row", "non-refoulement", "extraterritorial"]
    },
    {
      "id": "mccann-v-uk",
      "name": "McCann and Others v. United Kingdom",
      "year": 1995,
      "court": "ECtHR",
      "articles": ["2"],
      "category": "right-to-life",
      "importance": "landmark",
      "facts": "Three IRA members were shot dead by British SAS soldiers in Gibraltar. The UK claimed they were about to detonate a car bomb, but no bomb or detonators were found on them.",
      "issue": "Whether the use of lethal force was justified under Article 2(2) ECHR.",
      "holding": "Violation of Article 2. While soldiers honestly believed lives were at risk, the planning and control of the operation was flawed. Force must be 'absolutely necessary.'",
      "significance": "Established that lethal force must be 'absolutely necessary' - a stricter standard than 'necessary in a democratic society.' States must plan operations to minimize risk to life.",
      "keywords": ["lethal force", "absolutely necessary", "right to life", "planning", "proportionality"]
    },
    {
      "id": "osman-v-uk",
      "name": "Osman v. United Kingdom",
      "year": 1998,
      "court": "ECtHR",
      "articles": ["2"],
      "category": "positive-obligations",
      "importance": "landmark",
      "facts": "A teacher developed an obsession with a student. Despite warnings, police failed to act. The teacher killed the student's father and injured the student.",
      "issue": "Whether the state's failure to protect the victims violated Article 2's positive obligations.",
      "holding": "No violation on facts, but established the 'Osman test': states must take preventive measures where authorities knew or ought to have known of a real and immediate threat to life.",
      "significance": "Established positive obligations under Article 2. The 'Osman test' is now standard for assessing state duty to protect life from third parties.",
      "keywords": ["positive obligations", "Osman test", "duty to protect", "real and immediate threat", "preventive measures"]
    },
    {
      "id": "handyside-v-uk",
      "name": "Handyside v. United Kingdom",
      "year": 1976,
      "court": "ECtHR",
      "articles": ["10"],
      "category": "expression",
      "importance": "landmark",
      "facts": "Publisher convicted for publishing 'The Little Red Schoolbook' containing information on sex, drugs, etc. for schoolchildren.",
      "issue": "Whether the conviction violated freedom of expression under Article 10.",
      "holding": "No violation. States have margin of appreciation in protecting morals. However, the Court established key principles on scope of Article 10.",
      "significance": "Established that Article 10 protects information that 'offends, shocks or disturbs.' Freedom of expression is foundation of democratic society. Also developed margin of appreciation doctrine.",
      "keywords": ["freedom of expression", "offends shocks disturbs", "margin of appreciation", "morals", "democracy"]
    },
    {
      "id": "tyrer-v-uk",
      "name": "Tyrer v. United Kingdom",
      "year": 1978,
      "court": "ECtHR",
      "articles": ["3"],
      "category": "degrading-treatment",
      "importance": "landmark",
      "facts": "A 15-year-old was sentenced to three strokes of the birch (corporal punishment) in the Isle of Man for assault.",
      "issue": "Whether judicial corporal punishment constituted degrading punishment under Article 3.",
      "holding": "Violation of Article 3. The birching was degrading punishment, treating the applicant as an object in the power of authorities.",
      "significance": "Introduced the 'living instrument' doctrine - the Convention must be interpreted in light of present-day conditions, not 1950 standards. Corporal punishment increasingly unacceptable.",
      "keywords": ["living instrument", "degrading punishment", "corporal punishment", "evolving standards", "dynamic interpretation"]
    },
    {
      "id": "dudgeon-v-uk",
      "name": "Dudgeon v. United Kingdom",
      "year": 1981,
      "court": "ECtHR",
      "articles": ["8"],
      "category": "private-life",
      "importance": "landmark",
      "facts": "Northern Ireland law criminalized homosexual acts between consenting adult men. Dudgeon, a gay man, challenged this as violating his private life.",
      "issue": "Whether criminalization of consensual homosexual acts violated Article 8.",
      "holding": "Violation of Article 8. The interference was not 'necessary in a democratic society.' No pressing social need justified such broad criminalization.",
      "significance": "First major LGBTI rights case. Led to decriminalization across Europe. Established that sexual orientation is protected under private life.",
      "keywords": ["homosexuality", "private life", "decriminalization", "LGBTI rights", "necessary in democratic society"]
    },
    {
      "id": "selmouni-v-france",
      "name": "Selmouni v. France",
      "year": 1999,
      "court": "ECtHR",
      "articles": ["3"],
      "category": "torture",
      "importance": "landmark",
      "facts": "Selmouni was severely beaten and sexually assaulted by police during detention on drug charges.",
      "issue": "Whether the treatment constituted torture under Article 3.",
      "holding": "Violation - the treatment constituted TORTURE (not just inhuman treatment). The Court raised the bar, finding treatment previously classified as inhuman could now be torture.",
      "significance": "Applied 'living instrument' to Article 3 - standards evolve upward. What was inhuman treatment in 1978 (Ireland v UK) might be torture today. 'Selmouni threshold.'",
      "keywords": ["torture", "police brutality", "living instrument", "evolving standards", "Selmouni threshold"]
    },
    {
      "id": "gafgen-v-germany",
      "name": "Gäfgen v. Germany",
      "year": 2010,
      "court": "ECtHR",
      "articles": ["3", "6"],
      "category": "torture",
      "importance": "significant",
      "facts": "Police threatened Gäfgen with torture to reveal location of kidnapped child. He confessed, child found dead. Conviction based partly on evidence found due to confession.",
      "issue": "Whether threat of torture violated Article 3, and whether use of evidence violated Article 6.",
      "holding": "Article 3 violation for the threat (inhuman treatment). No Article 6 violation as conviction not based solely on tainted evidence.",
      "significance": "Confirmed absolute nature of Article 3 - even threat of torture violates it. 'Ticking bomb' scenarios don't justify torture. But addressed complex fair trial issues.",
      "keywords": ["threat of torture", "ticking bomb", "absolute prohibition", "fair trial", "evidence"]
    },
    {
      "id": "lautsi-v-italy",
      "name": "Lautsi v. Italy",
      "year": 2011,
      "court": "ECtHR",
      "articles": ["9", "P1-2"],
      "category": "religion",
      "importance": "significant",
      "facts": "Mother challenged mandatory display of crucifixes in Italian public school classrooms as violating religious freedom and right to education.",
      "issue": "Whether crucifixes in classrooms violated Article 9 and Article 2 Protocol 1.",
      "holding": "Grand Chamber: No violation. Crucifixes are 'passive symbols' within state's margin of appreciation. States can decide on religious traditions in education.",
      "significance": "Wide margin of appreciation for states on religious symbols in education. Distinction between 'passive' symbols and active indoctrination. Controversial - Chamber had found violation.",
      "keywords": ["religious symbols", "crucifix", "education", "margin of appreciation", "passive symbol", "secularism"]
    },
    {
      "id": "sas-v-france",
      "name": "S.A.S. v. France",
      "year": 2014,
      "court": "ECtHR",
      "articles": ["8", "9"],
      "category": "religion",
      "importance": "significant",
      "facts": "French law banned covering one's face in public. A Muslim woman wearing niqab challenged this as violating her religious freedom and private life.",
      "issue": "Whether the ban on face-covering violated Articles 8 and 9.",
      "holding": "No violation. The Court accepted 'living together' as a legitimate aim. Wide margin of appreciation given to France on this societal choice.",
      "significance": "Controversial acceptance of 'living together' as legitimate aim. Wide margin for states on face-covering bans. Criticized for limiting religious freedom.",
      "keywords": ["face veil", "niqab", "burqa ban", "living together", "religious freedom", "margin of appreciation"]
    },
    {
      "id": "pretty-v-uk",
      "name": "Pretty v. United Kingdom",
      "year": 2002,
      "court": "ECtHR",
      "articles": ["2", "3", "8"],
      "category": "end-of-life",
      "importance": "significant",
      "facts": "Diane Pretty, terminally ill with motor neurone disease, wanted her husband to help her die without prosecution. UK refused to guarantee immunity.",
      "issue": "Whether the right to life includes a right to die, and whether refusal violated Articles 2, 3, 8.",
      "holding": "No violation. Article 2 protects life, not the right to die. Article 8 engaged but interference justified to protect vulnerable people.",
      "significance": "Article 2 does not include right to die. Personal autonomy under Article 8 doesn't extend to assisted suicide. States can prohibit to protect vulnerable.",
      "keywords": ["assisted suicide", "right to die", "end of life", "personal autonomy", "vulnerable persons"]
    },
    {
      "id": "lopez-ostra-v-spain",
      "name": "López Ostra v. Spain",
      "year": 1994,
      "court": "ECtHR",
      "articles": ["8"],
      "category": "environment",
      "importance": "landmark",
      "facts": "A waste treatment plant near the applicant's home caused severe pollution, fumes, and health problems. Authorities failed to act despite complaints.",
      "issue": "Whether environmental pollution violated Article 8 (private and family life, home).",
      "holding": "Violation of Article 8. Severe environmental pollution can affect well-being and prevent enjoyment of home, even without serious health damage.",
      "significance": "Groundbreaking for environmental rights. Established that Article 8 protects against severe environmental pollution. No need to prove serious health damage.",
      "keywords": ["environmental rights", "pollution", "private life", "home", "positive obligations"]
    },
    {
      "id": "oneryildiz-v-turkey",
      "name": "Öneryıldız v. Turkey",
      "year": 2004,
      "court": "ECtHR",
      "articles": ["2", "P1-1"],
      "category": "environment",
      "importance": "landmark",
      "facts": "A methane explosion at a garbage dump killed 39 people living in a nearby slum. Authorities knew of the danger but failed to act.",
      "issue": "Whether failure to protect against known environmental danger violated Article 2.",
      "holding": "Violation of Article 2. States have positive obligations to protect life from dangerous activities, including industrial and environmental hazards.",
      "significance": "Extended Osman positive obligations to environmental/industrial dangers. States must take preventive measures against known life-threatening hazards.",
      "keywords": ["positive obligations", "environmental hazards", "dangerous activities", "preventive measures", "right to life"]
    },
    {
      "id": "hatton-v-uk",
      "name": "Hatton v. United Kingdom",
      "year": 2003,
      "court": "ECtHR",
      "articles": ["8"],
      "category": "environment",
      "importance": "significant",
      "facts": "Residents near Heathrow airport complained that night flights disturbed their sleep and violated their private life and home.",
      "issue": "Whether night flight noise violated Article 8.",
      "holding": "Grand Chamber: No violation. Wide margin of appreciation for balancing economic interests against environmental concerns. Adequate measures taken.",
      "significance": "Showed limits of environmental protection under Article 8. Economic considerations can outweigh environmental concerns. Wide margin for states.",
      "keywords": ["noise pollution", "night flights", "economic interests", "margin of appreciation", "balancing"]
    },
    {
      "id": "mss-v-belgium-greece",
      "name": "M.S.S. v. Belgium and Greece",
      "year": 2011,
      "court": "ECtHR",
      "articles": ["3", "13"],
      "category": "asylum",
      "importance": "landmark",
      "facts": "Afghan asylum seeker transferred from Belgium to Greece under Dublin Regulation. In Greece, he faced detention in degrading conditions and destitution.",
      "issue": "Whether the transfer violated Articles 3 and 13.",
      "holding": "Violations by both states. Greece: detention conditions and living conditions violated Article 3. Belgium: transferred despite knowing of Greek conditions.",
      "significance": "Major impact on Dublin system. States cannot transfer asylum seekers to countries with inadequate systems. Must assess real conditions, not just trust other EU states.",
      "keywords": ["Dublin Regulation", "asylum", "detention conditions", "transfer", "systemic deficiencies"]
    },
    {
      "id": "al-skeini-v-uk",
      "name": "Al-Skeini v. United Kingdom",
      "year": 2011,
      "court": "ECtHR",
      "articles": ["1", "2"],
      "category": "jurisdiction",
      "importance": "landmark",
      "facts": "Iraqi civilians killed by British soldiers during UK occupation of Basra. UK argued ECHR didn't apply extraterritorially.",
      "issue": "Whether the ECHR applied to UK actions in occupied Iraq.",
      "holding": "ECHR applied. UK exercised 'authority and control' over individuals through its soldiers. Violations of Article 2 found (inadequate investigations).",
      "significance": "Clarified extraterritorial application of ECHR. Convention applies where state exercises control and authority over individuals, including in occupied territories.",
      "keywords": ["extraterritorial", "jurisdiction", "occupation", "authority and control", "investigation duty"]
    },
    {
      "id": "jersild-v-denmark",
      "name": "Jersild v. Denmark",
      "year": 1994,
      "court": "ECtHR",
      "articles": ["10"],
      "category": "expression",
      "importance": "significant",
      "facts": "TV journalist convicted for aiding dissemination of racist statements by interviewing members of a racist youth group.",
      "issue": "Whether conviction of journalist for broadcasting racist statements violated Article 10.",
      "holding": "Violation of Article 10. Journalist was reporting on racism, not promoting it. Press has duty to impart information on matters of public interest.",
      "significance": "Protected journalistic reporting on controversial topics. Distinguished between reporting on racism and promoting it. Press freedom essential for democracy.",
      "keywords": ["press freedom", "journalism", "racist speech", "reporting", "public interest"]
    },
    {
      "id": "von-hannover-v-germany",
      "name": "Von Hannover v. Germany",
      "year": 2004,
      "court": "ECtHR",
      "articles": ["8"],
      "category": "privacy",
      "importance": "significant",
      "facts": "Princess Caroline of Monaco challenged publication of photos showing her in daily life (shopping, skiing, etc.) without consent.",
      "issue": "Whether publication of photos violated her right to private life.",
      "holding": "Violation of Article 8. Photos of daily life didn't contribute to public debate. Public figures retain private life protection outside official functions.",
      "significance": "Balanced privacy vs press freedom. Public figures have privacy rights in private activities. Photos must contribute to debate of general interest.",
      "keywords": ["privacy", "public figures", "paparazzi", "press freedom", "balancing"]
    },
    {
      "id": "klass-v-germany",
      "name": "Klass v. Germany",
      "year": 1978,
      "court": "ECtHR",
      "articles": ["8", "13"],
      "category": "surveillance",
      "importance": "landmark",
      "facts": "German law allowed secret surveillance without notification. Applicants challenged this as violating privacy even without proof they were surveilled.",
      "issue": "Whether secret surveillance laws violated Articles 8 and 13.",
      "holding": "No violation on facts (adequate safeguards), but established that secret surveillance can violate Article 8. Adequate safeguards required.",
      "significance": "Foundation for surveillance jurisprudence. Secret surveillance interferes with Article 8. Must have legal basis, necessity, and safeguards against abuse.",
      "keywords": ["surveillance", "secret monitoring", "safeguards", "privacy", "national security"]
    },
    {
      "id": "big-brother-watch-v-uk",
      "name": "Big Brother Watch v. United Kingdom",
      "year": 2021,
      "court": "ECtHR",
      "articles": ["8", "10"],
      "category": "surveillance",
      "importance": "landmark",
      "facts": "Challenge to UK bulk interception programs revealed by Edward Snowden, including GCHQ's TEMPORA program.",
      "issue": "Whether bulk interception and intelligence sharing violated Articles 8 and 10.",
      "holding": "Violations found. Bulk interception regime lacked adequate safeguards. Intelligence sharing with foreign agencies also violated Convention.",
      "significance": "Major ruling on mass surveillance. Bulk interception not per se incompatible but requires strong safeguards. Journalistic sources need special protection.",
      "keywords": ["bulk interception", "mass surveillance", "Snowden", "safeguards", "journalistic sources"]
    },
    {
      "id": "hirst-v-uk",
      "name": "Hirst v. United Kingdom (No. 2)",
      "year": 2005,
      "court": "ECtHR",
      "articles": ["P1-3"],
      "category": "voting",
      "importance": "significant",
      "facts": "UK law imposed blanket ban on all convicted prisoners voting, regardless of offense or sentence length.",
      "issue": "Whether blanket prisoner voting ban violated right to free elections.",
      "holding": "Violation of Article 3 Protocol 1. Blanket ban was disproportionate. Some restrictions permissible but must be proportionate, not automatic.",
      "significance": "Controversial - UK resisted implementation for years. Showed limits of margin of appreciation. Blanket bans often disproportionate.",
      "keywords": ["prisoner voting", "blanket ban", "proportionality", "elections", "disenfranchisement"]
    },
    {
      "id": "sahin-v-turkey",
      "name": "Şahin v. Turkey",
      "year": 2005,
      "court": "ECtHR",
      "articles": ["9"],
      "category": "religion",
      "importance": "significant",
      "facts": "University student barred from exams for wearing Islamic headscarf. Turkey banned headscarves in universities.",
      "issue": "Whether headscarf ban in universities violated Article 9.",
      "holding": "No violation. Wide margin of appreciation for Turkey given its secular constitutional tradition. Ban pursued legitimate aims.",
      "significance": "Controversial - wide margin for secularism. States can restrict religious dress in educational institutions. Compare with later cases.",
      "keywords": ["headscarf", "hijab", "secularism", "university", "religious dress"]
    },
    {
      "id": "chahal-v-uk",
      "name": "Chahal v. United Kingdom",
      "year": 1996,
      "court": "ECtHR",
      "articles": ["3", "5", "13"],
      "category": "deportation",
      "importance": "landmark",
      "facts": "Sikh separatist faced deportation to India on national security grounds. He claimed risk of torture if returned.",
      "issue": "Whether deportation despite national security concerns would violate Article 3.",
      "holding": "Deportation would violate Article 3. The prohibition is ABSOLUTE - national security cannot justify exposing someone to torture risk.",
      "significance": "Confirmed absolute nature of Article 3 in deportation context. No balancing against national security. Non-refoulement is absolute.",
      "keywords": ["deportation", "national security", "absolute prohibition", "non-refoulement", "terrorism"]
    },
    {
      "id": "saadi-v-italy",
      "name": "Saadi v. Italy",
      "year": 2008,
      "court": "ECtHR",
      "articles": ["3"],
      "category": "deportation",
      "importance": "landmark",
      "facts": "Tunisian convicted of terrorism-related offenses faced deportation. Italy sought diplomatic assurances from Tunisia.",
      "issue": "Whether diplomatic assurances could permit deportation despite torture risk.",
      "holding": "Deportation would violate Article 3. Diplomatic assurances insufficient where systematic torture exists. Article 3 absolute regardless of applicant's conduct.",
      "significance": "Rejected diplomatic assurances as sufficient safeguard. Confirmed Article 3 applies regardless of what the person has done. No exceptions for terrorists.",
      "keywords": ["diplomatic assurances", "terrorism", "absolute prohibition", "deportation", "torture risk"]
    },
    {
      "id": "hirsi-jamaa-v-italy",
      "name": "Hirsi Jamaa v. Italy",
      "year": 2012,
      "court": "ECtHR",
      "articles": ["3", "P4-4"],
      "category": "migration",
      "importance": "landmark",
      "facts": "Italian authorities intercepted migrants at sea and returned them to Libya without individual assessment of asylum claims.",
      "issue": "Whether push-backs at sea violated Article 3 and prohibition of collective expulsion.",
      "holding": "Violations found. Push-backs exposed migrants to torture risk in Libya. Collective expulsion without individual assessment prohibited.",
      "significance": "Extended ECHR protection to high seas. States cannot avoid obligations through extraterritorial push-backs. Individual assessment required.",
      "keywords": ["push-backs", "high seas", "collective expulsion", "migration", "Libya"]
    },
    {
      "id": "n-v-uk",
      "name": "N. v. United Kingdom",
      "year": 2008,
      "court": "ECtHR",
      "articles": ["3"],
      "category": "health",
      "importance": "significant",
      "facts": "Ugandan woman with AIDS faced deportation. She argued removal would deprive her of treatment available in UK, leading to premature death.",
      "issue": "Whether deportation of seriously ill person to country with inadequate healthcare violated Article 3.",
      "holding": "No violation. Very high threshold - only 'very exceptional circumstances' where removal would result in serious, rapid, irreversible decline.",
      "significance": "Set high threshold for medical cases. Article 3 doesn't require states to provide healthcare to all. But see Paposhvili (2016) which lowered threshold slightly.",
      "keywords": ["medical cases", "healthcare", "deportation", "AIDS", "exceptional circumstances"]
    },
    {
      "id": "paposhvili-v-belgium",
      "name": "Paposhvili v. Belgium",
      "year": 2016,
      "court": "ECtHR",
      "articles": ["3", "8"],
      "category": "health",
      "importance": "significant",
      "facts": "Georgian man with leukemia faced deportation. He died before judgment. Family continued case.",
      "issue": "Whether deportation of seriously ill person violated Articles 3 and 8.",
      "holding": "Would have violated Article 3. Lowered threshold from N. v. UK - includes cases where lack of treatment would cause serious, rapid, irreversible decline OR significant reduction in life expectancy.",
      "significance": "Softened the harsh N. v. UK threshold. States must assess availability of treatment in receiving country. More protection for seriously ill.",
      "keywords": ["medical cases", "serious illness", "treatment availability", "threshold", "life expectancy"]
    },
    {
      "id": "broniowski-v-poland",
      "name": "Broniowski v. Poland",
      "year": 2004,
      "court": "ECtHR",
      "articles": ["P1-1"],
      "category": "property",
      "importance": "landmark",
      "facts": "Poland failed to compensate people displaced from territories ceded to USSR after WWII. Systemic problem affecting 80,000 people.",
      "issue": "Whether failure to compensate violated property rights, and how to address systemic problem.",
      "holding": "Violation found. First 'pilot judgment' - Court identified systemic problem and required Poland to adopt general measures.",
      "significance": "Introduced pilot judgment procedure for systemic violations. Court can require general measures, not just individual remedies. Addresses repetitive cases.",
      "keywords": ["pilot judgment", "systemic problem", "property", "general measures", "repetitive cases"]
    },
    {
      "id": "scoppola-v-italy",
      "name": "Scoppola v. Italy (No. 3)",
      "year": 2012,
      "court": "ECtHR",
      "articles": ["P1-3"],
      "category": "voting",
      "importance": "significant",
      "facts": "Italian law permanently disenfranchised those sentenced to 5+ years. Applicant serving life sentence couldn't vote.",
      "issue": "Whether permanent disenfranchisement violated right to vote.",
      "holding": "No violation. Distinguished from Hirst - Italian system not blanket, considers offense gravity. Permanent ban for serious crimes within margin.",
      "significance": "Showed Hirst doesn't prohibit all prisoner voting restrictions. Proportionate, non-automatic restrictions permissible. Margin of appreciation.",
      "keywords": ["prisoner voting", "proportionality", "serious crimes", "permanent ban", "margin of appreciation"]
    },
    {
      "id": "oliari-v-italy",
      "name": "Oliari v. Italy",
      "year": 2015,
      "court": "ECtHR",
      "articles": ["8"],
      "category": "family",
      "importance": "significant",
      "facts": "Same-sex couples challenged Italy's failure to provide any legal recognition for their relationships.",
      "issue": "Whether lack of legal recognition for same-sex couples violated Article 8.",
      "holding": "Violation of Article 8. Italy failed to provide legal framework for same-sex couples despite Constitutional Court rulings requiring it.",
      "significance": "Required states to provide some form of legal recognition for same-sex couples. Doesn't require marriage, but some framework needed.",
      "keywords": ["same-sex couples", "legal recognition", "civil unions", "positive obligations", "family life"]
    },
    {
      "id": "goodwin-v-uk",
      "name": "Goodwin v. United Kingdom",
      "year": 2002,
      "court": "ECtHR",
      "articles": ["8", "12"],
      "category": "gender",
      "importance": "landmark",
      "facts": "Post-operative transgender woman couldn't change legal gender, affecting employment, pensions, and marriage.",
      "issue": "Whether failure to legally recognize gender reassignment violated Articles 8 and 12.",
      "holding": "Violations of both articles. UK must legally recognize acquired gender. Right to marry applies to acquired gender.",
      "significance": "Landmark for transgender rights. States must legally recognize gender reassignment. Living instrument approach - European consensus had evolved.",
      "keywords": ["transgender", "gender recognition", "marriage", "living instrument", "European consensus"]
    },
    {
      "id": "x-y-v-netherlands",
      "name": "X and Y v. Netherlands",
      "year": 1985,
      "court": "ECtHR",
      "articles": ["8"],
      "category": "positive-obligations",
      "importance": "landmark",
      "facts": "Mentally disabled girl sexually assaulted. Dutch law didn't allow her father to file criminal complaint on her behalf, and she couldn't do so herself.",
      "issue": "Whether gap in criminal law violated Article 8.",
      "holding": "Violation of Article 8. States have positive obligation to protect physical and moral integrity through adequate legal framework, including criminal law.",
      "significance": "Established positive obligations under Article 8 to protect against private interference. Criminal law may be required to protect vulnerable persons.",
      "keywords": ["positive obligations", "criminal law", "vulnerable persons", "sexual assault", "legal framework"]
    },
    {
      "id": "airey-v-ireland",
      "name": "Airey v. Ireland",
      "year": 1979,
      "court": "ECtHR",
      "articles": ["6", "8"],
      "category": "access-to-justice",
      "importance": "landmark",
      "facts": "Woman couldn't afford lawyer to obtain judicial separation from violent husband. No legal aid available for family cases.",
      "issue": "Whether lack of legal aid violated right to court access and family life.",
      "holding": "Violations found. Effective access to court may require legal aid. Convention rights must be 'practical and effective, not theoretical and illusory.'",
      "significance": "Established that Convention rights must be practical and effective. States may need to provide legal aid for effective court access.",
      "keywords": ["legal aid", "access to court", "practical and effective", "family law", "effective access"]
    },
    {
      "id": "golder-v-uk",
      "name": "Golder v. United Kingdom",
      "year": 1975,
      "court": "ECtHR",
      "articles": ["6", "8"],
      "category": "access-to-justice",
      "importance": "landmark",
      "facts": "Prisoner denied permission to consult solicitor to sue prison officer for defamation.",
      "issue": "Whether denial of access to lawyer violated Article 6.",
      "holding": "Violation. Article 6 includes right of access to court, not just fair hearing once in court. Prisoners retain this right.",
      "significance": "Established that Article 6 includes implied right of access to court. Foundation for access to justice jurisprudence.",
      "keywords": ["access to court", "implied right", "prisoners", "solicitor", "fair trial"]
    },
    {
      "id": "engel-v-netherlands",
      "name": "Engel v. Netherlands",
      "year": 1976,
      "court": "ECtHR",
      "articles": ["5", "6"],
      "category": "criminal",
      "importance": "landmark",
      "facts": "Military servicemen given disciplinary penalties. They argued these were 'criminal' requiring Article 6 protections.",
      "issue": "What constitutes a 'criminal charge' under Article 6?",
      "holding": "Developed 'Engel criteria' for determining criminal charge: domestic classification, nature of offense, severity of penalty.",
      "significance": "Established autonomous meaning of 'criminal charge.' States cannot avoid Article 6 by labeling penalties as 'administrative' or 'disciplinary.'",
      "keywords": ["criminal charge", "Engel criteria", "autonomous meaning", "disciplinary", "administrative"]
    },
    {
      "id": "salduz-v-turkey",
      "name": "Salduz v. Turkey",
      "year": 2008,
      "court": "ECtHR",
      "articles": ["6"],
      "category": "fair-trial",
      "importance": "landmark",
      "facts": "Minor denied access to lawyer during police custody. Made self-incriminating statements later used at trial.",
      "issue": "Whether denial of lawyer access during police questioning violated Article 6.",
      "holding": "Violation. Access to lawyer required from first police interrogation. Restrictions only in exceptional circumstances with compelling reasons.",
      "significance": "Strengthened right to lawyer during police custody. 'Salduz doctrine' - early access to lawyer essential for fair trial rights.",
      "keywords": ["right to lawyer", "police custody", "interrogation", "Salduz doctrine", "self-incrimination"]
    },
    {
      "id": "ibrahim-v-uk",
      "name": "Ibrahim v. United Kingdom",
      "year": 2016,
      "court": "ECtHR",
      "articles": ["6"],
      "category": "fair-trial",
      "importance": "significant",
      "facts": "Suspects in 21/7 London bombing attempts questioned without lawyers under urgent public safety exception.",
      "issue": "Whether denial of lawyer access in terrorism emergency violated Article 6.",
      "holding": "No violation for three applicants (compelling reasons existed). Violation for fourth (no compelling reasons shown).",
      "significance": "Clarified when Salduz restrictions permissible. Compelling reasons required. Overall fairness assessment. Public safety can justify temporary restrictions.",
      "keywords": ["terrorism", "compelling reasons", "public safety", "lawyer access", "overall fairness"]
    },
    {
      "id": "taxquet-v-belgium",
      "name": "Taxquet v. Belgium",
      "year": 2010,
      "court": "ECtHR",
      "articles": ["6"],
      "category": "fair-trial",
      "importance": "significant",
      "facts": "Convicted by jury that gave no reasons for verdict. Belgian juries traditionally don't give reasons.",
      "issue": "Whether unreasoned jury verdict violated fair trial rights.",
      "holding": "Violation. While jury systems compatible with Article 6, accused must understand why convicted. Some form of reasoning required.",
      "significance": "Addressed jury systems and reasoning. Doesn't require detailed reasons but accused must understand basis for conviction.",
      "keywords": ["jury", "reasoned judgment", "verdict", "understanding conviction", "fair trial"]
    },
    {
      "id": "al-khawaja-v-uk",
      "name": "Al-Khawaja and Tahery v. United Kingdom",
      "year": 2011,
      "court": "ECtHR",
      "articles": ["6"],
      "category": "fair-trial",
      "importance": "landmark",
      "facts": "Convictions based on statements of witnesses who didn't testify at trial (one died, one too afraid).",
      "issue": "Whether conviction based on untested witness statements violated Article 6.",
      "holding": "Developed new test: (1) good reason for absence, (2) if sole or decisive evidence, (3) sufficient counterbalancing factors.",
      "significance": "Reformed 'sole or decisive' rule. Conviction can be based on absent witness if sufficient safeguards. Dialogue with UK Supreme Court.",
      "keywords": ["witness", "hearsay", "sole or decisive", "counterbalancing factors", "confrontation"]
    },
    {
      "id": "othman-v-uk",
      "name": "Othman (Abu Qatada) v. United Kingdom",
      "year": 2012,
      "court": "ECtHR",
      "articles": ["3", "6"],
      "category": "deportation",
      "importance": "significant",
      "facts": "Radical cleric faced deportation to Jordan where he'd been convicted in absentia using torture-obtained evidence.",
      "issue": "Whether deportation would violate Articles 3 and 6.",
      "holding": "No Article 3 violation (diplomatic assurances sufficient). But Article 6 violation - real risk of flagrant denial of justice from torture evidence.",
      "significance": "First case finding Article 6 bars deportation. 'Flagrant denial of justice' test. Torture-obtained evidence fundamentally unfair.",
      "keywords": ["flagrant denial of justice", "torture evidence", "deportation", "diplomatic assurances", "fair trial"]
    },
    {
      "id": "campbell-v-uk",
      "name": "Campbell v. United Kingdom",
      "year": 1992,
      "court": "ECtHR",
      "articles": ["8"],
      "category": "prisoners",
      "importance": "significant",
      "facts": "Prisoner's correspondence with lawyer opened and read by prison authorities.",
      "issue": "Whether monitoring prisoner-lawyer correspondence violated Article 8.",
      "holding": "Violation. Lawyer-client correspondence privileged. Opening only permissible if reasonable cause to believe abuse.",
      "significance": "Protected lawyer-client privilege in prison context. Legal correspondence requires special protection.",
      "keywords": ["prisoner correspondence", "legal privilege", "lawyer-client", "monitoring", "privacy"]
    },
    {
      "id": "hentrich-v-france",
      "name": "Hentrich v. France",
      "year": 1994,
      "court": "ECtHR",
      "articles": ["P1-1", "6"],
      "category": "property",
      "importance": "significant",
      "facts": "French tax authorities exercised pre-emption right to purchase property at declared price, suspecting undervaluation.",
      "issue": "Whether pre-emption without adequate procedural safeguards violated property rights.",
      "holding": "Violation. Pre-emption arbitrary without sufficient safeguards. Owner couldn't effectively challenge.",
      "significance": "Property deprivation requires procedural fairness. Arbitrary interference violates Protocol 1.",
      "keywords": ["property", "pre-emption", "procedural safeguards", "arbitrary", "fair balance"]
    },
    {
      "id": "james-v-uk",
      "name": "James v. United Kingdom",
      "year": 1986,
      "court": "ECtHR",
      "articles": ["P1-1"],
      "category": "property",
      "importance": "landmark",
      "facts": "UK leasehold reform allowed tenants to compulsorily purchase freeholds. Landlords challenged as deprivation without public interest.",
      "issue": "Whether compulsory transfer of property between private parties violated Protocol 1.",
      "holding": "No violation. 'Public interest' broadly interpreted. Social justice and housing policy legitimate. Compensation not always full market value.",
      "significance": "Wide margin for states on property regulation. Public interest includes social policy. Transfer between private parties can be justified.",
      "keywords": ["property", "public interest", "leasehold reform", "compensation", "social policy"]
    },
    {
      "id": "sporrong-v-sweden",
      "name": "Sporrong and Lönnroth v. Sweden",
      "year": 1982,
      "court": "ECtHR",
      "articles": ["P1-1"],
      "category": "property",
      "importance": "landmark",
      "facts": "Long-term expropriation permits and building prohibitions on properties, lasting decades without compensation.",
      "issue": "Whether prolonged restrictions on property use violated Protocol 1.",
      "holding": "Violation. Even without formal deprivation, prolonged restrictions upset fair balance between public interest and individual rights.",
      "significance": "Established three-rule structure for Protocol 1: peaceful enjoyment, deprivation, control of use. Fair balance required.",
      "keywords": ["property", "fair balance", "three rules", "control of use", "proportionality"]
    },
    {
      "id": "velasquez-rodriguez",
      "name": "Velásquez Rodríguez v. Honduras",
      "year": 1988,
      "court": "IACtHR",
      "articles": ["ACHR 4", "ACHR 5", "ACHR 7"],
      "category": "disappearance",
      "importance": "landmark",
      "facts": "Student disappeared after arrest by Honduran military. Pattern of state-sponsored disappearances.",
      "issue": "State responsibility for enforced disappearance.",
      "holding": "Honduras violated rights to life, humane treatment, and liberty. State has duty to prevent, investigate, punish, and provide reparation.",
      "significance": "First contentious judgment of IACtHR. Established comprehensive state duties. Foundation for disappearance jurisprudence.",
      "keywords": ["enforced disappearance", "state responsibility", "duty to investigate", "Inter-American", "reparations"]
    },
    {
      "id": "legal-consequences-wall",
      "name": "Legal Consequences of Construction of Wall in OPT",
      "year": 2004,
      "court": "ICJ",
      "articles": ["Advisory"],
      "category": "occupation",
      "importance": "landmark",
      "facts": "UN General Assembly requested advisory opinion on Israel's construction of barrier in occupied Palestinian territory.",
      "issue": "Legality of the wall under international law.",
      "holding": "Wall violates international law including humanitarian law and human rights. Israel must cease construction, dismantle, and make reparation.",
      "significance": "Major advisory opinion on occupation and human rights. Affirmed applicability of human rights law in occupied territories.",
      "keywords": ["advisory opinion", "occupation", "wall", "Palestine", "humanitarian law"]
    },
    {
      "id": "genocide-convention-case",
      "name": "Application of Genocide Convention (Bosnia v. Serbia)",
      "year": 2007,
      "court": "ICJ",
      "articles": ["Genocide Convention"],
      "category": "genocide",
      "importance": "landmark",
      "facts": "Bosnia alleged Serbia committed genocide during 1992-1995 war, particularly at Srebrenica.",
      "issue": "Whether Serbia committed or was complicit in genocide.",
      "holding": "Srebrenica massacre was genocide. Serbia didn't commit genocide but violated duty to prevent (knew of serious risk) and duty to punish (failed to transfer Mladić).",
      "significance": "First ICJ judgment on state responsibility for genocide. Clarified prevention and punishment duties.",
      "keywords": ["genocide", "Srebrenica", "state responsibility", "duty to prevent", "ICJ"]
    },
    {
      "id": "toonen-v-australia",
      "name": "Toonen v. Australia",
      "year": 1994,
      "court": "HRCtee",
      "articles": ["ICCPR 17", "ICCPR 26"],
      "category": "privacy",
      "importance": "landmark",
      "facts": "Tasmania criminalized homosexual acts between consenting adults. Toonen challenged under ICCPR.",
      "issue": "Whether criminalization violated privacy and non-discrimination.",
      "holding": "Violation of Article 17 (privacy). 'Sex' in Article 26 includes sexual orientation. Tasmania must repeal laws.",
      "significance": "First UN body to find sexual orientation protected. Led to decriminalization in Tasmania. Influential globally.",
      "keywords": ["sexual orientation", "privacy", "discrimination", "Human Rights Committee", "decriminalization"]
    }
  ]
}
